clc
clear

% x =[x theta phi x_dot theta_dot phi_dot]

g = 9.8;
Km = 0.3*187/3591; %转矩常数 N*m/A
R = 0.095/2;%轮子半径 m
bw = 0;
Mw = 0.134;
Iw = 0.000020;
T = 0.005;%控制周期
Cfw = 0.000098;%电机阻尼系数

Mb = 0.860;
Ib = 0.000311;
L = 0.005548;

Mr = 0.087;
L0 = 0.1;
H = 0.175;
Ir = 0.000311;
Cfr = 0.000005;%摆杆阻尼系数

A = [0 0 0 1 0 0;
     0 0 0 0 1 0; 
     0 0 0 0 0 1;
     0 -27.6081   0.966339   -0.0561659   0.0561659   -0.0000322073; 
     0 117.836    -32.5875   0.0792697    -0.0792697  0.00108612;
     0 -39.0589   35.4825   -0.0219192    0.0219192   -0.00118261];

B = [0;
     0;
     0;
     17.9071;
     -25.2731;
     6.98836];

C = eye(6);

D = zeros(6,1);

Co=ctrb(A,B);
[~,ran]=size(A);
if rank(Co)==ran
    'controlable'
else
    'uncontrolable'
end

R = 1 ;%控制量加权，积分后代表能量功率
Q = [1  0  0  0  0  0;
     0  1  0  0  0  0;
     0  0  1  0  0  0;
     0  0  0  1  0  0;
     0  0  0  0  1  0;
     0  0  0  0  0  1;]; %误差加权，越重要的状态变量，权值越大

k = lqrd(A,B,Q,R,T);
display(k);
k0 = k(1);
k1 = k(2);
k2 = k(3);
k3 = k(4);
k4 = k(5);
k5 = k(6);
fprintf('%f , %f , %f , %f , %f , %f \n',k0,k1,k2,k3,k4,k5);
period = 0.005;
